app/views/userboard/index.html.haml

SELECT  `sources`.* FROM `sources`  WHERE `sources`.`user_id` = 2  ORDER BY `sources`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `sources`  WHERE `sources`.`user_id` = 2
---
:javascript
  dt_table = $("#data_table").dataTable({
    sPaginationType: "simple",
    lengthMenu: [[15, 30, 50], [15, 30, 50]],
    bJQueryUI: true,
    bProcessing: true,
    bServerSide: true,
    aoColumnDefs: [ { "bSortable": false, "aTargets": [4] } ],
    sAjaxSource: $('#data_table').data('source'),
    fnServerParams: function (aoData) {
      aoData.push({name: "sSearch", value: $("#key").val()});
    },
    fnInfoCallback: function( oSettings, iStart, iEnd, iMax, iTotal, sPre ) {
      var res = iStart +" to "+ iEnd + " of " + iTotal;
      $("#page_description").html(res);
      return "";
    },
    fnRowCallback: function(nRow, aData, iDisplayIndex){
      var id = aData[aData.length-1];
      $(nRow).attr("id",id);
      return nRow;
    },oLanguage: {