app/controllers/dashboard/users_controller.rb

INSERT INTO `users` (`authentication_token`, `confirmed_at`, `created_at`, `email`, `encrypted_password`, `updated_at`) VALUES ('szgQapmrpEFwchoQQUs7', '2016-04-05 02:04:43', '2016-04-05 02:04:43', 'dvidlui@gmail.com', '$2a$10$oB/K6WWHFUkAoJZMA/Z/G.PVD/OGPdmKLuHVib.yB2teBxiePMpHq', '2016-04-05 02:04:43')
---
  def create
    user = User.new(user_params)
    user.skip_confirmation!
    if user.save

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `confirmation_sent_at` = '2016-04-05 02:04:46', `confirmation_token` = 'f19c60e141c7b2b7cf138b535355c458f9182d50bede25e459109bf8ded59936', `updated_at` = '2016-04-05 02:04:46' WHERE `users`.`id` = 2
---
  def send_invite
    user = User.find(params[:id])
    if user.present? && user.update_attributes(invitation_sent_at: DateTime.now.to_date)

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
---
  def profile
    if params[:id].present?
      @user = User.find(params[:id])

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$10$gwFndKKk.BhD2sDgkGuOcO5Kgxf4bqLlfQghNnDXw9vRLEeNFD4b.', `first_name` = 'David', `last_name` = 'Lui', `updated_at` = '2016-04-05 02:05:19' WHERE `users`.`id` = 2
---
  def update_profile
    @user = User.find(params[:user_id])
    @user.confirm!
    # @user.skip_reconfirmation!
    if params[:type] == "admin"  &&  current_user.super_admin?
      if @user.update_attributes(user_params)