app/controllers/users/sessions_controller.rb

  def create
    user = User.where(email: params[:user][:email].strip).first
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'admin@test.com'  ORDER BY `users`.`id` ASC LIMIT 1